NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFR32FG12P/EFR32FG12P433F1024GM68.svd
        <register>
          <name>DCDCLPEM01CFG</name>
          <description>Configuration Bits for Low Power Mode to Be Applied During EM01, This Field is Only Relevant If LP Mode is Used in EM01</description>
          <addressOffset>0x0EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000300</resetValue>
          <resetMask>0x0000F300</resetMask>
          <fields>
            <field>
              <name>LPCMPBIASEM01</name>
              <description>LP Mode Comparator Bias Selection for EM01</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIAS0</name>
                  <description>Maximum load current less than 75uA.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS1</name>
                  <description>Maximum load current less than 500uA.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS2</name>
                  <description>Maximum load current less than 2.5mA.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS3</name>
                  <description>Maximum load current less than 10mA.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPCMPHYSSELEM01</name>
              <description>LP Mode Hysteresis Selection for EM01</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23PERNORETAINCMD</name>
          <description>Clears Corresponding Bits in EM23PERNORETAINSTATUS Unlocking Access to Peripheral</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>ACMP0UNLOCK</name>
              <description>Clears Status Bit of ACMP0 and Unlocks Access to It</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACMP1UNLOCK</name>
              <description>Clears Status Bit of ACMP1 and Unlocks Access to It</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0UNLOCK</name>
              <description>Clears Status Bit of PCNT0 and Unlocks Access to It</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT1UNLOCK</name>
              <description>Clears Status Bit of PCNT1 and Unlocks Access to It</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT2UNLOCK</name>
              <description>Clears Status Bit of PCNT2 and Unlocks Access to It</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C0UNLOCK</name>
              <description>Clears Status Bit of I2C0 and Unlocks Access to It</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C1UNLOCK</name>
              <description>Clears Status Bit of I2C1 and Unlocks Access to It</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DAC0UNLOCK</name>
              <description>Clears Status Bit of DAC0 and Unlocks Access to It</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IDAC0UNLOCK</name>
              <description>Clears Status Bit of IDAC0 and Unlocks Access to It</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0UNLOCK</name>
              <description>Clears Status Bit of ADC0 and Unlocks Access to It</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LETIMER0UNLOCK</name>
              <description>Clears Status Bit of LETIMER0 and Unlocks Access to It</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDOG0UNLOCK</name>
              <description>Clears Status Bit of WDOG0 and Unlocks Access to It</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDOG1UNLOCK</name>
              <description>Clears Status Bit of WDOG1 and Unlocks Access to It</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LESENSE0UNLOCK</name>
              <description>Clears Status Bit of LESENSE0 and Unlocks Access to It</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSENUNLOCK</name>
              <description>Clears Status Bit of CSEN and Unlocks Access to It</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEUART0UNLOCK</name>
              <description>Clears Status Bit of LEUART0 and Unlocks Access to It</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23PERNORETAINSTATUS</name>
          <description>Status Indicating If Peripherals Were Powered Down in EM23, Subsequently Locking Access to It</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>ACMP0LOCKED</name>
              <description>Indicates If ACMP0 Powered Down During EM23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACMP1LOCKED</name>
              <description>Indicates If ACMP1 Powered Down During EM23</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT0LOCKED</name>
              <description>Indicates If PCNT0 Powered Down During EM23</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT1LOCKED</name>
              <description>Indicates If PCNT1 Powered Down During EM23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT2LOCKED</name>
              <description>Indicates If PCNT2 Powered Down During EM23</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C0LOCKED</name>
              <description>Indicates If I2C0 Powered Down During EM23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C1LOCKED</name>
              <description>Indicates If I2C1 Powered Down During EM23</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAC0LOCKED</name>
              <description>Indicates If DAC0 Powered Down During EM23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDAC0LOCKED</name>
              <description>Indicates If IDAC0 Powered Down During EM23</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0LOCKED</name>
              <description>Indicates If ADC0 Powered Down During EM23</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LETIMER0LOCKED</name>
              <description>Indicates If LETIMER0 Powered Down During EM23</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDOG0LOCKED</name>
              <description>Indicates If WDOG0 Powered Down During EM23</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDOG1LOCKED</name>
              <description>Indicates If WDOG1 Powered Down During EM23</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LESENSE0LOCKED</name>
              <description>Indicates If LESENSE0 Powered Down During EM23</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSENLOCKED</name>
              <description>Indicates If CSEN Powered Down During EM23</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LEUART0LOCKED</name>
              <description>Indicates If LEUART0 Powered Down During EM23</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23PERNORETAINCTRL</name>
          <description>When Set Corresponding Peripherals May Get Powered Down in EM23</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>ACMP0DIS</name>
              <description>Allow Power Down of ACMP0 During EM23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP1DIS</name>
              <description>Allow Power Down of ACMP1 During EM23</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0DIS</name>
              <description>Allow Power Down of PCNT0 During EM23</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT1DIS</name>
              <description>Allow Power Down of PCNT1 During EM23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT2DIS</name>
              <description>Allow Power Down of PCNT2 During EM23</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0DIS</name>
              <description>Allow Power Down of I2C0 During EM23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1DIS</name>
              <description>Allow Power Down of I2C1 During EM23</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDAC0DIS</name>
              <description>Allow Power Down of DAC0 During EM23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAC0DIS</name>
              <description>Allow Power Down of IDAC0 During EM23</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0DIS</name>
              <description>Allow Power Down of ADC0 During EM23</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LETIMER0DIS</name>
              <description>Allow Power Down of LETIMER0 During EM23</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG0DIS</name>
              <description>Allow Power Down of WDOG0 During EM23</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG1DIS</name>
              <description>Allow Power Down of WDOG1 During EM23</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LESENSE0DIS</name>
              <description>Allow Power Down of LESENSE0 During EM23</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSENDIS</name>
              <description>Allow Power Down of CSEN During EM23</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEUART0DIS</name>
              <description>Allow Power Down of LEUART0 During EM23</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
